ninety-nine-cats/app/controllers/cats_controller.rb

    def update
        #find the cat
        #modify the cat
        #render the cat
        @cat = Cat.find(params[:id])
        @cat.update(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["sex", "F"], ["updated_at", "2023-05-05 22:40:17.514543"], ["id", 4]]